#  - Создайте переменную immutable_var и присвойте ей кортеж из нескольких элементов разных типов данных.
immutable_var = (1, 2, 3.0, 4.0, 'кортеж', ['a','b','c'])
#  - Выполните операции вывода кортежа immutable_var на экран.
print (immutable_var)
immutable_var[3] = 7 # - Попытайтесь изменить элементы кортежа immutable_var.
# immutable_var[4] = 'список' # - Попытайтесь изменить элементы кортежа immutable_var.
print (immutable_var)


# 4. Создание изменяемых структур данных:

  #- Создайте переменную mutable_list и присвойте ей список из нескольких элементов.

  # Измените элементы списка mutable_list.

  #- Выведите на экран измененный список mutable_list.



#Примечания:

#- Для вывода значений на экран используйте функцию print().

#- Обратите внимание на особенности изменяемых и неизменяемых объектов в Python.